CSI API ETABS v1
cAnalysisResults.JointDrifts Method
 Reports the joint drifts
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int JointDrifts(
	ref int NumberResults,
	ref string[] Story,
	ref string[] Label,
	ref string[] Name,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] DisplacementX,
	ref double[] DisplacementY,
	ref double[] DriftX,
	ref double[] DriftY
)
Function JointDrifts (
	ByRef NumberResults As Integer,
	ByRef Story As String(),
	ByRef Label As String(),
	ByRef Name As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef DisplacementX As Double(),
	ByRef DisplacementY As Double(),
	ByRef DriftX As Double(),
	ByRef DriftY As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim Story As String()
Dim Label As String()
Dim Name As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim DisplacementX As Double()
Dim DisplacementY As Double()
Dim DriftX As Double()
Dim DriftY As Double()
Dim returnValue As Integer
returnValue = instance.JointDrifts(NumberResults,
	Story, Label, Name, LoadCase, StepType,
	StepNum, DisplacementX, DisplacementY,
	DriftX, DriftY)
int JointDrifts(
	int% NumberResults,
	array<String^>^% Story,
	array<String^>^% Label,
	array<String^>^% Name,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% DisplacementX,
	array<double>^% DisplacementY,
	array<double>^% DriftX,
	array<double>^% DriftY
)
abstract JointDrifts :
        NumberResults : int byref *
        Story : string[] byref *
        Label : string[] byref *
        Name : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        DisplacementX : float[] byref *
        DisplacementY : float[] byref *
        DriftX : float[] byref *
        DriftY : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
Story
Type: System.String[]
 This is an array of the story levels associated with each result
Label
Type: System.String[]
 This is an array of the point labels for each result
Name
Type: System.String[]
 This is an array of the unique point names for each result
LoadCase
Type: System.String[]
 This is an array of the names of the analysis case or load combination associated with each result
StepType
Type: System.String[]
 This is an array of the step types, if any, for each result
StepNum
Type: System.Double[]
 This is an array of the step numbers, if any, for each result
DisplacementX
Type: System.Double[]
 This is an array of the displacements in the X direction [L]
DisplacementY
Type: System.Double[]
 This is an array of the displacements in the Y direction [L]
DriftX
Type: System.Double[]
 This is an array of the drifts in the X direction [L]
DriftY
Type: System.Double[]
 This is an array of the drifts in the Y direction [L]
Return Value
Type: Int32
 Returns zero if the results are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace